espressif/esp-idf/components/soc/esp32s2beta/include/soc/spi_reg.h
#define SPI_USER2_REG(i)          (REG_SPI_BASE(i) + 0x020)
/* SPI_USR_COMMAND_BITLEN : R/W ;bitpos:[31:28] ;default: 4'd7 ; */
/*description: The length in bits of command phase. The register value shall
 be (bit_num-1). Can be configured in CONF state.*/
#define SPI_USR_COMMAND_BITLEN  0x0000000F
#define SPI_USR_COMMAND_BITLEN_M  ((SPI_USR_COMMAND_BITLEN_V)<<(SPI_USR_COMMAND_BITLEN_S))
#define SPI_USR_COMMAND_BITLEN_V  0xF
#define SPI_USR_COMMAND_BITLEN_S  28
/* SPI_USR_COMMAND_VALUE : R/W ;bitpos:[15:0] ;default: 16'b0 ; */
/*description: The value of  command. Can be configured in CONF state.*/
#define SPI_USR_COMMAND_VALUE  0x0000FFFF
#define SPI_USR_COMMAND_VALUE_M  ((SPI_USR_COMMAND_VALUE_V)<<(SPI_USR_COMMAND_VALUE_S))
#define SPI_USR_COMMAND_VALUE_V  0xFFFF
#define SPI_USR_COMMAND_VALUE_S  0

#define SPI_MOSI_DLEN_REG(i)          (REG_SPI_BASE(i) + 0x024)
/* SPI_USR_MOSI_DBITLEN : R/W ;bitpos:[22:0] ;default: 23'h0 ; */
/*description: The length in bits of write-data. The register value shall be
 (bit_num-1). Can be configured in CONF state.*/
#define SPI_USR_MOSI_DBITLEN  0x007FFFFF
#define SPI_USR_MOSI_DBITLEN_M  ((SPI_USR_MOSI_DBITLEN_V)<<(SPI_USR_MOSI_DBITLEN_S))
#define SPI_USR_MOSI_DBITLEN_V  0x7FFFFF
#define SPI_USR_MOSI_DBITLEN_S  0

#define SPI_MISO_DLEN_REG(i)          (REG_SPI_BASE(i) + 0x028)
/* SPI_USR_MISO_DBITLEN : R/W ;bitpos:[22:0] ;default: 23'h0 ; */
/*description: The length in bits of  read-data. The register value shall be
 (bit_num-1). Can be configured in CONF state.*/
#define SPI_USR_MISO_DBITLEN  0x007FFFFF
#define SPI_USR_MISO_DBITLEN_M  ((SPI_USR_MISO_DBITLEN_V)<<(SPI_USR_MISO_DBITLEN_S))
#define SPI_USR_MISO_DBITLEN_V  0x7FFFFF
#define SPI_USR_MISO_DBITLEN_S  0

#define SPI_SLV_WR_STATUS_REG(i)          (REG_SPI_BASE(i) + 0x02C)
/* SPI_OPI_MODE : R/W ;bitpos:[1] ;default: 1'b0 ; */
/*description: Just for master mode. 1: spi controller is in OPI mode (all in
 8-b-m). 0: others. Can be configured in CONF state.*/
#define SPI_OPI_MODE  (BIT(1))
#define SPI_OPI_MODE_M  (BIT(1))
#define SPI_OPI_MODE_V  0x1
#define SPI_OPI_MODE_S  1
/* SPI_QPI_MODE : R/W ;bitpos:[0] ;default: 1'b0 ; */
/*description: Both for master mode and slave mode. 1: spi controller is in
 QPI mode. 0: others. Can be configured in CONF state.*/
#define SPI_QPI_MODE  (BIT(0))
#define SPI_QPI_MODE_M  (BIT(0))
#define SPI_QPI_MODE_V  0x1
#define SPI_QPI_MODE_S  0

#define SPI_MISC_REG(i)          (REG_SPI_BASE(i) + 0x030)
/* SPI_QUAD_DIN_PIN_SWAP : R/W ;bitpos:[31] ;default: 1'h0 ; */
/*description: 1:  spi quad input swap enable  0:  spi quad input swap disable.
 Can be configured in CONF state.*/
#define SPI_QUAD_DIN_PIN_SWAP  (BIT(31))
#define SPI_QUAD_DIN_PIN_SWAP_M  (BIT(31))
#define SPI_QUAD_DIN_PIN_SWAP_V  0x1
#define SPI_QUAD_DIN_PIN_SWAP_S  31
/* SPI_CS_KEEP_ACTIVE : R/W ;bitpos:[30] ;default: 1'b0 ; */
/*description: spi cs line keep low when the bit is set. Can be configured in CONF state.*/
#define SPI_CS_KEEP_ACTIVE  (BIT(30))
#define SPI_CS_KEEP_ACTIVE_M  (BIT(30))
#define SPI_CS_KEEP_ACTIVE_V  0x1
#define SPI_CS_KEEP_ACTIVE_S  30
/* SPI_CK_IDLE_EDGE : R/W ;bitpos:[29] ;default: 1'b0 ; */
/*description: 1: spi clk line is high when idle     0: spi clk line is low
 when idle. Can be configured in CONF state.*/
#define SPI_CK_IDLE_EDGE  (BIT(29))
#define SPI_CK_IDLE_EDGE_M  (BIT(29))
#define SPI_CK_IDLE_EDGE_V  0x1
#define SPI_CK_IDLE_EDGE_S  29
/* SPI_CD_IDLE_EDGE : R/W ;bitpos:[26] ;default: 1'b0 ; */
/*description: The default value of spi_cd. Can be configured in CONF state.*/
#define SPI_CD_IDLE_EDGE  (BIT(26))
#define SPI_CD_IDLE_EDGE_M  (BIT(26))
#define SPI_CD_IDLE_EDGE_V  0x1
#define SPI_CD_IDLE_EDGE_S  26
/* SPI_CD_CMD_SET : R/W ;bitpos:[25] ;default: 1'b0 ; */
/*description: 1: spi_cd = !spi_cd_idle_edge when spi_st[3:0] is in SPI_SEND_CMD
 state.  0: spi_cd = spi_cd_idle_edge. Can be configured in CONF state.*/
#define SPI_CD_CMD_SET  (BIT(25))
#define SPI_CD_CMD_SET_M  (BIT(25))
#define SPI_CD_CMD_SET_V  0x1
#define SPI_CD_CMD_SET_S  25
/* SPI_DQS_IDLE_EDGE : R/W ;bitpos:[24] ;default: 1'b0 ; */
/*description: The default value of spi_dqs. Can be configured in CONF state.*/
#define SPI_DQS_IDLE_EDGE  (BIT(24))
#define SPI_DQS_IDLE_EDGE_M  (BIT(24))
#define SPI_DQS_IDLE_EDGE_V  0x1
#define SPI_DQS_IDLE_EDGE_S  24
/* SPI_SLAVE_CS_POL : R/W ;bitpos:[23] ;default: 1'b0 ; */
/*description: spi slave input cs polarity select. 1: inv  0: not change. Can
 be configured in CONF state.*/
#define SPI_SLAVE_CS_POL  (BIT(23))
#define SPI_SLAVE_CS_POL_M  (BIT(23))
#define SPI_SLAVE_CS_POL_V  0x1
#define SPI_SLAVE_CS_POL_S  23
/* SPI_CD_ADDR_SET : R/W ;bitpos:[22] ;default: 1'b0 ; */
/*description: 1: spi_cd = !spi_cd_idle_edge when spi_st[3:0] is in SPI_SEND_ADDR
 state.  0: spi_cd = spi_cd_idle_edge. Can be configured in CONF state.*/
#define SPI_CD_ADDR_SET  (BIT(22))
#define SPI_CD_ADDR_SET_M  (BIT(22))
#define SPI_CD_ADDR_SET_V  0x1
#define SPI_CD_ADDR_SET_S  22
/* SPI_CD_DUMMY_SET : R/W ;bitpos:[21] ;default: 1'b0 ; */
/*description: 1: spi_cd = !spi_cd_idle_edge when spi_st[3:0] is in SPI_DUMMY
 state.  0: spi_cd = spi_cd_idle_edge. Can be configured in CONF state.*/
#define SPI_CD_DUMMY_SET  (BIT(21))
#define SPI_CD_DUMMY_SET_M  (BIT(21))
#define SPI_CD_DUMMY_SET_V  0x1
#define SPI_CD_DUMMY_SET_S  21
/* SPI_CD_DATA_SET : R/W ;bitpos:[20] ;default: 1'b0 ; */
/*description: 1: spi_cd = !spi_cd_idle_edge when spi_st[3:0] is in SPI_DOUT
 or SPI_DIN state.  0: spi_cd = spi_cd_idle_edge. Can be configured in CONF state.*/
#define SPI_CD_DATA_SET  (BIT(20))
#define SPI_CD_DATA_SET_M  (BIT(20))
#define SPI_CD_DATA_SET_V  0x1
#define SPI_CD_DATA_SET_S  20
/* SPI_MASTER_CS_POL : R/W ;bitpos:[12:7] ;default: 6'b0 ; */
/*description: In the master mode the bits are the polarity of spi cs line 
 the value is equivalent to spi_cs ^ spi_master_cs_pol. Can be configured in CONF state.*/
#define SPI_MASTER_CS_POL  0x0000003F
#define SPI_MASTER_CS_POL_M  ((SPI_MASTER_CS_POL_V)<<(SPI_MASTER_CS_POL_S))
#define SPI_MASTER_CS_POL_V  0x3F
#define SPI_MASTER_CS_POL_S  7
/* SPI_CK_DIS : R/W ;bitpos:[6] ;default: 1'b0 ; */
/*description: 1: spi clk out disable   0: spi clk out enable. Can be configured in CONF state.*/
#define SPI_CK_DIS  (BIT(6))
#define SPI_CK_DIS_M  (BIT(6))
#define SPI_CK_DIS_V  0x1
#define SPI_CK_DIS_S  6
/* SPI_CS5_DIS : R/W ;bitpos:[5] ;default: 1'b1 ; */
/*description: SPI CS5 pin enable  1: disable CS5  0: spi_cs5 signal is from/to
 CS5 pin. Can be configured in CONF state.*/
#define SPI_CS5_DIS  (BIT(5))
#define SPI_CS5_DIS_M  (BIT(5))
#define SPI_CS5_DIS_V  0x1
#define SPI_CS5_DIS_S  5
/* SPI_CS4_DIS : R/W ;bitpos:[4] ;default: 1'b1 ; */
/*description: SPI CS4 pin enable  1: disable CS4  0: spi_cs4 signal is from/to
 CS4 pin. Can be configured in CONF state.*/
#define SPI_CS4_DIS  (BIT(4))
#define SPI_CS4_DIS_M  (BIT(4))
#define SPI_CS4_DIS_V  0x1
#define SPI_CS4_DIS_S  4
/* SPI_CS3_DIS : R/W ;bitpos:[3] ;default: 1'b1 ; */
/*description: reserved*/
#define SPI_CS3_DIS  (BIT(3))
#define SPI_CS3_DIS_M  (BIT(3))
#define SPI_CS3_DIS_V  0x1
#define SPI_CS3_DIS_S  3
/* SPI_CS2_DIS : R/W ;bitpos:[2] ;default: 1'b1 ; */
/*description: SPI CS2 pin enable  1: disable CS2  0: spi_cs2 signal is from/to
 CS2 pin. Can be configured in CONF state.*/
#define SPI_CS2_DIS  (BIT(2))
#define SPI_CS2_DIS_M  (BIT(2))
#define SPI_CS2_DIS_V  0x1
#define SPI_CS2_DIS_S  2
/* SPI_CS1_DIS : R/W ;bitpos:[1] ;default: 1'b1 ; */
/*description: SPI CS1 pin enable  1: disable CS1  0: spi_cs1 signal is from/to
 CS1 pin. Can be configured in CONF state.*/
#define SPI_CS1_DIS  (BIT(1))
#define SPI_CS1_DIS_M  (BIT(1))
#define SPI_CS1_DIS_V  0x1
#define SPI_CS1_DIS_S  1
/* SPI_CS0_DIS : R/W ;bitpos:[0] ;default: 1'b0 ; */
/*description: SPI CS0 pin enable  1: disable CS0  0: spi_cs0 signal is from/to
 CS0 pin. Can be configured in CONF state.*/
#define SPI_CS0_DIS  (BIT(0))
#define SPI_CS0_DIS_M  (BIT(0))
#define SPI_CS0_DIS_V  0x1
#define SPI_CS0_DIS_S  0

#define SPI_SLAVE_REG(i)          (REG_SPI_BASE(i) + 0x034)
/* SPI_SOFT_RESET : R/W ;bitpos:[31] ;default: 1'b0 ; */
/*description: Software reset enable  reset the spi clock line cs line and data
 lines. Can be configured in CONF state.*/
#define SPI_SOFT_RESET  (BIT(31))
#define SPI_SOFT_RESET_M  (BIT(31))
#define SPI_SOFT_RESET_V  0x1
#define SPI_SOFT_RESET_S  31
/* SPI_SLAVE_MODE : R/W ;bitpos:[30] ;default: 1'b0 ; */
/*description: Set SPI work mode. 1: slave mode 0: master mode. Can be configured
 in CONF state.*/
#define SPI_SLAVE_MODE  (BIT(30))
#define SPI_SLAVE_MODE_M  (BIT(30))
#define SPI_SLAVE_MODE_V  0x1
#define SPI_SLAVE_MODE_S  30
/* SPI_TRANS_DONE_AUTO_CLR_EN : R/W ;bitpos:[29] ;default: 1'b0 ; */
/*description: spi_trans_done auto clear enable  clear it 3 apb cycles after
 the pos edge of spi_trans_done.  0:disable. 1: enable. Can be configured in CONF state.*/
#define SPI_TRANS_DONE_AUTO_CLR_EN  (BIT(29))
#define SPI_TRANS_DONE_AUTO_CLR_EN_M  (BIT(29))
#define SPI_TRANS_DONE_AUTO_CLR_EN_V  0x1
#define SPI_TRANS_DONE_AUTO_CLR_EN_S  29
/* SPI_TRANS_CNT : RO ;bitpos:[26:23] ;default: 4'b0 ; */
/*description: The operations counter in both the master mode and the slave mode.*/
#define SPI_TRANS_CNT  0x0000000F
#define SPI_TRANS_CNT_M  ((SPI_TRANS_CNT_V)<<(SPI_TRANS_CNT_S))
#define SPI_TRANS_CNT_V  0xF
#define SPI_TRANS_CNT_S  23
/* SPI_SEG_MAGIC_ERR_INT_EN : R/W ;bitpos:[11] ;default: 1'b0 ; */
/*description: 1: Enable seg magic value error interrupt. 0: Others. Can be
 configured in CONF state.*/
#define SPI_SEG_MAGIC_ERR_INT_EN  (BIT(11))
#define SPI_SEG_MAGIC_ERR_INT_EN_M  (BIT(11))
#define SPI_SEG_MAGIC_ERR_INT_EN_V  0x1
#define SPI_SEG_MAGIC_ERR_INT_EN_S  11
/* SPI_INT_DMA_SEG_TRANS_EN : R/W ;bitpos:[10] ;default: 1'b0 ; */
/*description: spi_dma_seg_trans_done Interrupt enable. 1: enable 0: disable.
 Can be configured in CONF state.*/
#define SPI_INT_DMA_SEG_TRANS_EN  (BIT(10))
#define SPI_INT_DMA_SEG_TRANS_EN_M  (BIT(10))
#define SPI_INT_DMA_SEG_TRANS_EN_V  0x1
#define SPI_INT_DMA_SEG_TRANS_EN_S  10
/* SPI_INT_TRANS_DONE_EN : R/W ;bitpos:[9] ;default: 1'b1 ; */
/*description: spi_trans_done Interrupt enable. 1: enable 0: disable. Can be
 configured in CONF state.*/
#define SPI_INT_TRANS_DONE_EN  (BIT(9))
#define SPI_INT_TRANS_DONE_EN_M  (BIT(9))
#define SPI_INT_TRANS_DONE_EN_V  0x1
#define SPI_INT_TRANS_DONE_EN_S  9
/* SPI_INT_WR_DMA_DONE_EN : R/W ;bitpos:[8] ;default: 1'b0 ; */
/*description: spi_slv_wr_dma Interrupt enable. 1: enable 0: disable. Can be
 configured in CONF state.*/
#define SPI_INT_WR_DMA_DONE_EN  (BIT(8))
#define SPI_INT_WR_DMA_DONE_EN_M  (BIT(8))
#define SPI_INT_WR_DMA_DONE_EN_V  0x1
#define SPI_INT_WR_DMA_DONE_EN_S  8
/* SPI_INT_RD_DMA_DONE_EN : R/W ;bitpos:[7] ;default: 1'b0 ; */
/*description: spi_slv_rd_dma Interrupt enable. 1: enable 0: disable. Can be
 configured in CONF state.*/
#define SPI_INT_RD_DMA_DONE_EN  (BIT(7))
#define SPI_INT_RD_DMA_DONE_EN_M  (BIT(7))
#define SPI_INT_RD_DMA_DONE_EN_V  0x1
#define SPI_INT_RD_DMA_DONE_EN_S  7
/* SPI_INT_WR_BUF_DONE_EN : R/W ;bitpos:[6] ;default: 1'b0 ; */
/*description: spi_slv_wr_buf Interrupt enable. 1: enable 0: disable. Can be
 configured in CONF state.*/
#define SPI_INT_WR_BUF_DONE_EN  (BIT(6))
#define SPI_INT_WR_BUF_DONE_EN_M  (BIT(6))
#define SPI_INT_WR_BUF_DONE_EN_V  0x1
#define SPI_INT_WR_BUF_DONE_EN_S  6
/* SPI_INT_RD_BUF_DONE_EN : R/W ;bitpos:[5] ;default: 1'b0 ; */
/*description: spi_slv_rd_buf Interrupt enable. 1: enable 0: disable. Can be
 configured in CONF state.*/
#define SPI_INT_RD_BUF_DONE_EN  (BIT(5))
#define SPI_INT_RD_BUF_DONE_EN_M  (BIT(5))
#define SPI_INT_RD_BUF_DONE_EN_V  0x1
#define SPI_INT_RD_BUF_DONE_EN_S  5
/* SPI_TRANS_DONE : R/W ;bitpos:[4] ;default: 1'b0 ; */
/*description: The interrupt raw bit for the completion of any operation in
 both the master mode and the slave mode.  Can not be changed by CONF_buf.*/
#define SPI_TRANS_DONE  (BIT(4))
#define SPI_TRANS_DONE_M  (BIT(4))
#define SPI_TRANS_DONE_V  0x1
#define SPI_TRANS_DONE_S  4

#define SPI_SLAVE1_REG(i)          (REG_SPI_BASE(i) + 0x038)
/* SPI_SLV_LAST_ADDR : R/W ;bitpos:[31:24] ;default: 8'd0 ; */
/*description: In the slave mode it is the value of address.*/
#define SPI_SLV_LAST_ADDR  0x000000FF
#define SPI_SLV_LAST_ADDR_M  ((SPI_SLV_LAST_ADDR_V)<<(SPI_SLV_LAST_ADDR_S))
#define SPI_SLV_LAST_ADDR_V  0xFF
#define SPI_SLV_LAST_ADDR_S  24
/* SPI_SLV_LAST_COMMAND : R/W ;bitpos:[23:16] ;default: 8'b0 ; */
/*description: In the slave mode it is the value of command.*/
#define SPI_SLV_LAST_COMMAND  0x000000FF
#define SPI_SLV_LAST_COMMAND_M  ((SPI_SLV_LAST_COMMAND_V)<<(SPI_SLV_LAST_COMMAND_S))
#define SPI_SLV_LAST_COMMAND_V  0xFF
#define SPI_SLV_LAST_COMMAND_S  16
/* SPI_SLV_WR_DMA_DONE : R/W ;bitpos:[15] ;default: 1'b0 ; */
/*description: The interrupt raw bit for the completion of dma write operation
 in the slave mode.  Can not be changed by CONF_buf.*/
#define SPI_SLV_WR_DMA_DONE  (BIT(15))
#define SPI_SLV_WR_DMA_DONE_M  (BIT(15))
#define SPI_SLV_WR_DMA_DONE_V  0x1
#define SPI_SLV_WR_DMA_DONE_S  15
/* SPI_SLV_CMD_ERR : R/W ;bitpos:[14] ;default: 1'b0 ; */
/*description: 1: The command value of the last SPI transfer is not supported
 by SPI slave. 0: The command value is supported or no command value is received.*/
#define SPI_SLV_CMD_ERR  (BIT(14))
#define SPI_SLV_CMD_ERR_M  (BIT(14))
#define SPI_SLV_CMD_ERR_V  0x1
#define SPI_SLV_CMD_ERR_S  14
/* SPI_SLV_ADDR_ERR : R/W ;bitpos:[13] ;default: 1'b0 ; */
/*description: 1: The address value of the last SPI transfer is not supported
 by SPI slave. 0: The address value is supported or no address value is received.*/
#define SPI_SLV_ADDR_ERR  (BIT(13))
#define SPI_SLV_ADDR_ERR_M  (BIT(13))
#define SPI_SLV_ADDR_ERR_V  0x1
#define SPI_SLV_ADDR_ERR_S  13

#define SPI_SLAVE2_REG(i)          (REG_SPI_BASE(i) + 0x03C)
/* SPI_SLV_RD_DMA_DONE : R/W ;bitpos:[8] ;default: 1'b0 ; */
/*description: The interrupt raw bit for the completion of Rd-DMA operation
 in the slave mode.  Can not be changed by CONF_buf.*/
#define SPI_SLV_RD_DMA_DONE  (BIT(8))
#define SPI_SLV_RD_DMA_DONE_M  (BIT(8))
#define SPI_SLV_RD_DMA_DONE_V  0x1
#define SPI_SLV_RD_DMA_DONE_S  8

#define SPI_SLV_WRBUF_DLEN_REG(i)          (REG_SPI_BASE(i) + 0x040)
/* SPI_CONF_BASE_BITLEN : R/W ;bitpos:[31:25] ;default: 7'd108 ; */
/*description: The basic spi_clk cycles of CONF state. The real cycle length
 of CONF state  if spi_usr_conf is enabled  is spi_conf_base_bitlen[6:0] + spi_conf_bitlen[23:0].*/
#define SPI_CONF_BASE_BITLEN  0x0000007F
#define SPI_CONF_BASE_BITLEN_M  ((SPI_CONF_BASE_BITLEN_V)<<(SPI_CONF_BASE_BITLEN_S))
#define SPI_CONF_BASE_BITLEN_V  0x7F
#define SPI_CONF_BASE_BITLEN_S  25
/* SPI_SLV_WR_BUF_DONE : R/W ;bitpos:[24] ;default: 1'b0 ; */
/*description: The interrupt raw bit for the completion of write-buffer operation
 in the slave mode.  Can not be changed by CONF_buf.*/
#define SPI_SLV_WR_BUF_DONE  (BIT(24))
#define SPI_SLV_WR_BUF_DONE_M  (BIT(24))
#define SPI_SLV_WR_BUF_DONE_V  0x1
#define SPI_SLV_WR_BUF_DONE_S  24

#define SPI_SLV_RDBUF_DLEN_REG(i)          (REG_SPI_BASE(i) + 0x044)
/* SPI_SEG_MAGIC_ERR : R/W ;bitpos:[25] ;default: 1'b0 ; */
/*description: 1: The recent magic value in CONF buffer is not right in master
 DMA seg-trans mode. 0: others.*/
#define SPI_SEG_MAGIC_ERR  (BIT(25))
#define SPI_SEG_MAGIC_ERR_M  (BIT(25))
#define SPI_SEG_MAGIC_ERR_V  0x1
#define SPI_SEG_MAGIC_ERR_S  25
/* SPI_SLV_RD_BUF_DONE : R/W ;bitpos:[24] ;default: 1'b0 ; */
/*description: The interrupt raw bit for the completion of read-buffer operation
 in the slave mode.  Can not be changed by CONF_buf.*/
#define SPI_SLV_RD_BUF_DONE  (BIT(24))
#define SPI_SLV_RD_BUF_DONE_M  (BIT(24))
#define SPI_SLV_RD_BUF_DONE_V  0x1
#define SPI_SLV_RD_BUF_DONE_S  24
/* SPI_SLV_DMA_RD_BYTELEN : R/W ;bitpos:[19:0] ;default: 20'h0 ; */
/*description: In the slave mode it is the length in bytes for read operations.
 The register value shall be byte_num.*/
#define SPI_SLV_DMA_RD_BYTELEN  0x000FFFFF
#define SPI_SLV_DMA_RD_BYTELEN_M  ((SPI_SLV_DMA_RD_BYTELEN_V)<<(SPI_SLV_DMA_RD_BYTELEN_S))
#define SPI_SLV_DMA_RD_BYTELEN_V  0xFFFFF
#define SPI_SLV_DMA_RD_BYTELEN_S  0

#define SPI_SLV_RD_BYTE_REG(i)          (REG_SPI_BASE(i) + 0x048)
/* SPI_USR_CONF : R/W ;bitpos:[31] ;default: 1'b0 ; */
/*description: 1: Enable the DMA CONF phase of current seg-trans operation 
 which means seg-trans will start. 0: This is not seg-trans mode.*/
#define SPI_USR_CONF  (BIT(31))
#define SPI_USR_CONF_M  (BIT(31))
#define SPI_USR_CONF_V  0x1
#define SPI_USR_CONF_S  31
/* SPI_DMA_SEG_MAGIC_VALUE : R/W ;bitpos:[29:24] ;default: 6'd23 ; */
/*description: The magic value of BM table in master DMA seg-trans.*/
#define SPI_DMA_SEG_MAGIC_VALUE  0x0000003F
#define SPI_DMA_SEG_MAGIC_VALUE_M  ((SPI_DMA_SEG_MAGIC_VALUE_V)<<(SPI_DMA_SEG_MAGIC_VALUE_S))
#define SPI_DMA_SEG_MAGIC_VALUE_V  0x3F
#define SPI_DMA_SEG_MAGIC_VALUE_S  24
/* SPI_SLV_WRBUF_BYTELEN_EN : R/W ;bitpos:[23] ;default: 1'b0 ; */
/*description: 1: spi_slv_data_bytelen stores data byte length of master-write-to-slave
 data length in CPU controlled mode(Wr_BUF). 0: others*/
#define SPI_SLV_WRBUF_BYTELEN_EN  (BIT(23))
#define SPI_SLV_WRBUF_BYTELEN_EN_M  (BIT(23))
#define SPI_SLV_WRBUF_BYTELEN_EN_V  0x1
#define SPI_SLV_WRBUF_BYTELEN_EN_S  23
/* SPI_SLV_RDBUF_BYTELEN_EN : R/W ;bitpos:[22] ;default: 1'b0 ; */
/*description: 1: spi_slv_data_bytelen stores data byte length of master-read-slave
 data length in CPU controlled mode(Rd_BUF). 0: others*/
#define SPI_SLV_RDBUF_BYTELEN_EN  (BIT(22))
#define SPI_SLV_RDBUF_BYTELEN_EN_M  (BIT(22))
#define SPI_SLV_RDBUF_BYTELEN_EN_V  0x1
#define SPI_SLV_RDBUF_BYTELEN_EN_S  22
/* SPI_SLV_WRDMA_BYTELEN_EN : R/W ;bitpos:[21] ;default: 1'b0 ; */
/*description: 1: spi_slv_data_bytelen stores data byte length of master-write-to-slave
 data length in DMA controlled mode(Wr_DMA). 0: others*/
#define SPI_SLV_WRDMA_BYTELEN_EN  (BIT(21))
#define SPI_SLV_WRDMA_BYTELEN_EN_M  (BIT(21))
#define SPI_SLV_WRDMA_BYTELEN_EN_V  0x1
#define SPI_SLV_WRDMA_BYTELEN_EN_S  21
/* SPI_SLV_RDDMA_BYTELEN_EN : R/W ;bitpos:[20] ;default: 1'b0 ; */
/*description: 1: spi_slv_data_bytelen stores data byte length of master-read-slave
 data length in DMA controlled mode(Rd_DMA). 0: others*/
#define SPI_SLV_RDDMA_BYTELEN_EN  (BIT(20))
#define SPI_SLV_RDDMA_BYTELEN_EN_M  (BIT(20))
#define SPI_SLV_RDDMA_BYTELEN_EN_V  0x1
#define SPI_SLV_RDDMA_BYTELEN_EN_S  20
/* SPI_SLV_DATA_BYTELEN : R/W ;bitpos:[19:0] ;default: 20'b0 ; */
/*description: The full-duplex or half-duplex data byte length of the last SPI
 transfer in slave mode. In half-duplex mode  this value is controlled by bits [23:20].*/
#define SPI_SLV_DATA_BYTELEN  0x000FFFFF
#define SPI_SLV_DATA_BYTELEN_M  ((SPI_SLV_DATA_BYTELEN_V)<<(SPI_SLV_DATA_BYTELEN_S))
#define SPI_SLV_DATA_BYTELEN_V  0xFFFFF
#define SPI_SLV_DATA_BYTELEN_S  0

#define SPI_FSM_REG(i)          (REG_SPI_BASE(i) + 0x050)
/* SPI_MST_DMA_RD_BYTELEN : R/W ;bitpos:[31:12] ;default: 20'h0 ; */
/*description: Define the master DMA read byte length in non seg-trans or seg-trans
 mode. Invalid when spi_rx_eof_en is 0. Can be configured in CONF state..*/
#define SPI_MST_DMA_RD_BYTELEN  0x000FFFFF
#define SPI_MST_DMA_RD_BYTELEN_M  ((SPI_MST_DMA_RD_BYTELEN_V)<<(SPI_MST_DMA_RD_BYTELEN_S))
#define SPI_MST_DMA_RD_BYTELEN_V  0xFFFFF
#define SPI_MST_DMA_RD_BYTELEN_S  12
/* SPI_ST : RO ;bitpos:[3:0] ;default: 4'b0 ; */
/*description: The status of spi state machine. 0: idle state  1: preparation
 state  2: send command state  3: send data state  4: red data state  5:write data state  6: wait state  7: done state.*/
#define SPI_ST  0x0000000F
#define SPI_ST_M  ((SPI_ST_V)<<(SPI_ST_S))
#define SPI_ST_V  0xF
#define SPI_ST_S  0

#define SPI_HOLD_REG(i)          (REG_SPI_BASE(i) + 0x054)
/* SPI_DMA_SEG_TRANS_DONE : R/W ;bitpos:[7] ;default: 1'b0 ; */
/*description: 1:  spi master DMA full-duplex/half-duplex seg-trans ends or
 slave half-duplex seg-trans ends. And data has been pushed to corresponding memory.  0:  seg-trans is not ended or not occurred.  Can not be changed by CONF_buf.*/
#define SPI_DMA_SEG_TRANS_DONE  (BIT(7))
#define SPI_DMA_SEG_TRANS_DONE_M  (BIT(7))
#define SPI_DMA_SEG_TRANS_DONE_V  0x1
#define SPI_DMA_SEG_TRANS_DONE_S  7
/* SPI_HOLD_OUT_TIME : R/W ;bitpos:[6:4] ;default: 3'b0 ; */
/*description: set the hold cycles of output spi_hold signal when spi_hold_out_en
 is enable. Can be configured in CONF state.*/
#define SPI_HOLD_OUT_TIME  0x00000007
#define SPI_HOLD_OUT_TIME_M  ((SPI_HOLD_OUT_TIME_V)<<(SPI_HOLD_OUT_TIME_S))
#define SPI_HOLD_OUT_TIME_V  0x7
#define SPI_HOLD_OUT_TIME_S  4
/* SPI_HOLD_OUT_EN : R/W ;bitpos:[3] ;default: 1'b0 ; */
/*description: Enable set spi output hold value to spi_hold_reg. It can be used
 to hold spi state machine with spi_ext_hold_en and other usr hold signals. Can be configured in CONF state.*/
#define SPI_HOLD_OUT_EN  (BIT(3))
#define SPI_HOLD_OUT_EN_M  (BIT(3))
#define SPI_HOLD_OUT_EN_V  0x1
#define SPI_HOLD_OUT_EN_S  3
/* SPI_HOLD_VAL_REG : R/W ;bitpos:[2] ;default: 1'b0 ; */
/*description: spi hold output value  which should be used with spi_hold_out_en.
 Can be configured in CONF state.*/
#define SPI_HOLD_VAL_REG  (BIT(2))
#define SPI_HOLD_VAL_REG_M  (BIT(2))
#define SPI_HOLD_VAL_REG_V  0x1
#define SPI_HOLD_VAL_REG_S  2
/* SPI_INT_HOLD_ENA : R/W ;bitpos:[1:0] ;default: 2'b0 ; */
/*description: This register is for two SPI masters to share the same cs clock
 and data signals. The bits of one SPI are set  if the other SPI is busy  the SPI will be hold. 1(3): hold at  idle  phase 2: hold at  prepare  phase. Can be configured in CONF state.*/
#define SPI_INT_HOLD_ENA  0x00000003
#define SPI_INT_HOLD_ENA_M  ((SPI_INT_HOLD_ENA_V)<<(SPI_INT_HOLD_ENA_S))
#define SPI_INT_HOLD_ENA_V  0x3
#define SPI_INT_HOLD_ENA_S  0

