espressif/esp-idf/components/soc/esp32s2beta/include/soc/spi_reg.h
#define SPI_DOUT_NUM_REG(i)          (REG_SPI_BASE(i) + 0x0F8)
/* SPI_DOUT7_NUM : R/W ;bitpos:[15:14] ;default: 2'h0 ; */
/*description: the output signals are delayed by system clock cycles  0: delayed
 by 1 cycle  1: delayed by 2 cycles ... Can be configured in CONF state.*/
#define SPI_DOUT7_NUM  0x00000003
#define SPI_DOUT7_NUM_M  ((SPI_DOUT7_NUM_V)<<(SPI_DOUT7_NUM_S))
#define SPI_DOUT7_NUM_V  0x3
#define SPI_DOUT7_NUM_S  14
/* SPI_DOUT6_NUM : R/W ;bitpos:[13:12] ;default: 2'h0 ; */
/*description: the output signals are delayed by system clock cycles  0: delayed
 by 1 cycle  1: delayed by 2 cycles ... Can be configured in CONF state.*/
#define SPI_DOUT6_NUM  0x00000003
#define SPI_DOUT6_NUM_M  ((SPI_DOUT6_NUM_V)<<(SPI_DOUT6_NUM_S))
#define SPI_DOUT6_NUM_V  0x3
#define SPI_DOUT6_NUM_S  12
/* SPI_DOUT5_NUM : R/W ;bitpos:[11:10] ;default: 2'h0 ; */
/*description: the output signals are delayed by system clock cycles  0: delayed
 by 1 cycle  1: delayed by 2 cycles ... Can be configured in CONF state.*/
#define SPI_DOUT5_NUM  0x00000003
#define SPI_DOUT5_NUM_M  ((SPI_DOUT5_NUM_V)<<(SPI_DOUT5_NUM_S))
#define SPI_DOUT5_NUM_V  0x3
#define SPI_DOUT5_NUM_S  10
/* SPI_DOUT4_NUM : R/W ;bitpos:[9:8] ;default: 2'h0 ; */
/*description: the output signals are delayed by system clock cycles  0: delayed
 by 1 cycle  1: delayed by 2 cycles ... Can be configured in CONF state.*/
#define SPI_DOUT4_NUM  0x00000003
#define SPI_DOUT4_NUM_M  ((SPI_DOUT4_NUM_V)<<(SPI_DOUT4_NUM_S))
#define SPI_DOUT4_NUM_V  0x3
#define SPI_DOUT4_NUM_S  8
/* SPI_DOUT3_NUM : R/W ;bitpos:[7:6] ;default: 2'h0 ; */
/*description: the output signals are delayed by system clock cycles  0: delayed
 by 1 cycle  1: delayed by 2 cycles ... Can be configured in CONF state.*/
#define SPI_DOUT3_NUM  0x00000003
#define SPI_DOUT3_NUM_M  ((SPI_DOUT3_NUM_V)<<(SPI_DOUT3_NUM_S))
#define SPI_DOUT3_NUM_V  0x3
#define SPI_DOUT3_NUM_S  6
/* SPI_DOUT2_NUM : R/W ;bitpos:[5:4] ;default: 2'h0 ; */
/*description: the output signals are delayed by system clock cycles  0: delayed
 by 1 cycle  1: delayed by 2 cycles ... Can be configured in CONF state.*/
#define SPI_DOUT2_NUM  0x00000003
#define SPI_DOUT2_NUM_M  ((SPI_DOUT2_NUM_V)<<(SPI_DOUT2_NUM_S))
#define SPI_DOUT2_NUM_V  0x3
#define SPI_DOUT2_NUM_S  4
/* SPI_DOUT1_NUM : R/W ;bitpos:[3:2] ;default: 2'h0 ; */
/*description: the output signals are delayed by system clock cycles  0: delayed
 by 1 cycle  1: delayed by 2 cycles ... Can be configured in CONF state.*/
#define SPI_DOUT1_NUM  0x00000003
#define SPI_DOUT1_NUM_M  ((SPI_DOUT1_NUM_V)<<(SPI_DOUT1_NUM_S))
#define SPI_DOUT1_NUM_V  0x3
#define SPI_DOUT1_NUM_S  2
/* SPI_DOUT0_NUM : R/W ;bitpos:[1:0] ;default: 2'h0 ; */
/*description: the output signals are delayed by system clock cycles  0: delayed
 by 1 cycle  1: delayed by 2 cycles ... Can be configured in CONF state.*/
#define SPI_DOUT0_NUM  0x00000003
#define SPI_DOUT0_NUM_M  ((SPI_DOUT0_NUM_V)<<(SPI_DOUT0_NUM_S))
#define SPI_DOUT0_NUM_V  0x3
#define SPI_DOUT0_NUM_S  0

#define SPI_LCD_CTRL_REG(i)          (REG_SPI_BASE(i) + 0x0FC)
/* SPI_LCD_SRGB_MODE_EN : R/W ;bitpos:[31] ;default: 1'b0 ; */
/*description: 1: Enable LCD mode output vsync  hsync  de. 0: Disable. Can be
 configured in CONF state.*/
#define SPI_LCD_SRGB_MODE_EN  (BIT(31))
#define SPI_LCD_SRGB_MODE_EN_M  (BIT(31))
#define SPI_LCD_SRGB_MODE_EN_V  0x1
#define SPI_LCD_SRGB_MODE_EN_S  31
/* SPI_LCD_VT_HEIGHT : R/W ;bitpos:[30:21] ;default: 10'd0 ; */
/*description: It is the vertical total height of a frame. Can be configured in CONF state.*/
#define SPI_LCD_VT_HEIGHT  0x000003FF
#define SPI_LCD_VT_HEIGHT_M  ((SPI_LCD_VT_HEIGHT_V)<<(SPI_LCD_VT_HEIGHT_S))
#define SPI_LCD_VT_HEIGHT_V  0x3FF
#define SPI_LCD_VT_HEIGHT_S  21
/* SPI_LCD_VA_HEIGHT : R/W ;bitpos:[20:11] ;default: 10'd0 ; */
/*description: It is the vertical active height of a frame. Can be configured in CONF state.*/
#define SPI_LCD_VA_HEIGHT  0x000003FF
#define SPI_LCD_VA_HEIGHT_M  ((SPI_LCD_VA_HEIGHT_V)<<(SPI_LCD_VA_HEIGHT_S))
#define SPI_LCD_VA_HEIGHT_V  0x3FF
#define SPI_LCD_VA_HEIGHT_S  11
/* SPI_LCD_HB_FRONT : R/W ;bitpos:[10:0] ;default: 11'd0 ; */
/*description: It is the horizontal blank front porch of a frame. Can be configured
 in CONF state.*/
#define SPI_LCD_HB_FRONT  0x000007FF
#define SPI_LCD_HB_FRONT_M  ((SPI_LCD_HB_FRONT_V)<<(SPI_LCD_HB_FRONT_S))
#define SPI_LCD_HB_FRONT_V  0x7FF
#define SPI_LCD_HB_FRONT_S  0

#define SPI_LCD_CTRL1_REG(i)          (REG_SPI_BASE(i) + 0x0100)
/* SPI_LCD_HT_WIDTH : R/W ;bitpos:[31:20] ;default: 12'd0 ; */
/*description: It is the horizontal total width of a frame. Can be configured in CONF state.*/
#define SPI_LCD_HT_WIDTH  0x00000FFF
#define SPI_LCD_HT_WIDTH_M  ((SPI_LCD_HT_WIDTH_V)<<(SPI_LCD_HT_WIDTH_S))
#define SPI_LCD_HT_WIDTH_V  0xFFF
#define SPI_LCD_HT_WIDTH_S  20
/* SPI_LCD_HA_WIDTH : R/W ;bitpos:[19:8] ;default: 12'd0 ; */
/*description: It is the horizontal active width of a frame. Can be configured in CONF state.*/
#define SPI_LCD_HA_WIDTH  0x00000FFF
#define SPI_LCD_HA_WIDTH_M  ((SPI_LCD_HA_WIDTH_V)<<(SPI_LCD_HA_WIDTH_S))
#define SPI_LCD_HA_WIDTH_V  0xFFF
#define SPI_LCD_HA_WIDTH_S  8
/* SPI_LCD_VB_FRONT : R/W ;bitpos:[7:0] ;default: 8'd0 ; */
/*description: It is the vertical blank front porch of a frame. Can be configured
 in CONF state.*/
#define SPI_LCD_VB_FRONT  0x000000FF
#define SPI_LCD_VB_FRONT_M  ((SPI_LCD_VB_FRONT_V)<<(SPI_LCD_VB_FRONT_S))
#define SPI_LCD_VB_FRONT_V  0xFF
#define SPI_LCD_VB_FRONT_S  0

#define SPI_LCD_CTRL2_REG(i)          (REG_SPI_BASE(i) + 0x0104)
/* SPI_LCD_HSYNC_POSITION : R/W ;bitpos:[31:24] ;default: 8'd0 ; */
/*description: It is the position of spi_hsync_out active pulse in a line. Can
 be configured in CONF state.*/
#define SPI_LCD_HSYNC_POSITION  0x000000FF
#define SPI_LCD_HSYNC_POSITION_M  ((SPI_LCD_HSYNC_POSITION_V)<<(SPI_LCD_HSYNC_POSITION_S))
#define SPI_LCD_HSYNC_POSITION_V  0xFF
#define SPI_LCD_HSYNC_POSITION_S  24
/* SPI_HSYNC_IDLE_POL : R/W ;bitpos:[23] ;default: 1'd0 ; */
/*description: It is the idle value of spi_hsync_out. Can be configured in CONF state.*/
#define SPI_HSYNC_IDLE_POL  (BIT(23))
#define SPI_HSYNC_IDLE_POL_M  (BIT(23))
#define SPI_HSYNC_IDLE_POL_V  0x1
#define SPI_HSYNC_IDLE_POL_S  23
/* SPI_LCD_HSYNC_WIDTH : R/W ;bitpos:[22:16] ;default: 7'd0 ; */
/*description: It is the position of spi_hsync_out active pulse in a line. Can
 be configured in CONF state.*/
#define SPI_LCD_HSYNC_WIDTH  0x0000007F
#define SPI_LCD_HSYNC_WIDTH_M  ((SPI_LCD_HSYNC_WIDTH_V)<<(SPI_LCD_HSYNC_WIDTH_S))
#define SPI_LCD_HSYNC_WIDTH_V  0x7F
#define SPI_LCD_HSYNC_WIDTH_S  16
/* SPI_LCD_VSYNC_POSITION : R/W ;bitpos:[15:8] ;default: 8'd0 ; */
/*description: It is the position of spi_vsync_out active pulse in a line. Can
 be configured in CONF state.*/
#define SPI_LCD_VSYNC_POSITION  0x000000FF
#define SPI_LCD_VSYNC_POSITION_M  ((SPI_LCD_VSYNC_POSITION_V)<<(SPI_LCD_VSYNC_POSITION_S))
#define SPI_LCD_VSYNC_POSITION_V  0xFF
#define SPI_LCD_VSYNC_POSITION_S  8
/* SPI_VSYNC_IDLE_POL : R/W ;bitpos:[7] ;default: 1'd0 ; */
/*description: It is the idle value of spi_vsync_out. Can be configured in CONF state.*/
#define SPI_VSYNC_IDLE_POL  (BIT(7))
#define SPI_VSYNC_IDLE_POL_M  (BIT(7))
#define SPI_VSYNC_IDLE_POL_V  0x1
#define SPI_VSYNC_IDLE_POL_S  7
/* SPI_LCD_VSYNC_WIDTH : R/W ;bitpos:[6:0] ;default: 7'd0 ; */
/*description: It is the position of spi_vsync_out active pulse in a line. Can
 be configured in CONF state.*/
#define SPI_LCD_VSYNC_WIDTH  0x0000007F
#define SPI_LCD_VSYNC_WIDTH_M  ((SPI_LCD_VSYNC_WIDTH_V)<<(SPI_LCD_VSYNC_WIDTH_S))
#define SPI_LCD_VSYNC_WIDTH_V  0x7F
#define SPI_LCD_VSYNC_WIDTH_S  0

