espressif/esp-idf/components/soc/esp32s2beta/include/soc/spi_reg.h
#define SPI_LCD_D_MODE_REG(i)          (REG_SPI_BASE(i) + 0x108)
/* SPI_D_VSYNC_MODE : R/W ;bitpos:[14:12] ;default: 3'h0 ; */
/*description: the output spi_vsync is delayed by system clock cycles  0: output
 without delayed  1: output with the posedge of clk_apb 2 output with the negedge of clk_apb  3: output with the spi_clk. Can be configured in CONF state.*/
#define SPI_D_VSYNC_MODE  0x00000007
#define SPI_D_VSYNC_MODE_M  ((SPI_D_VSYNC_MODE_V)<<(SPI_D_VSYNC_MODE_S))
#define SPI_D_VSYNC_MODE_V  0x7
#define SPI_D_VSYNC_MODE_S  12
/* SPI_D_HSYNC_MODE : R/W ;bitpos:[11:9] ;default: 3'h0 ; */
/*description: the output spi_hsync is delayed by system clock cycles  0: output
 without delayed  1: output with the posedge of clk_apb 2 output with the negedge of clk_apb  3: output with the spi_clk. Can be configured in CONF state.*/
#define SPI_D_HSYNC_MODE  0x00000007
#define SPI_D_HSYNC_MODE_M  ((SPI_D_HSYNC_MODE_V)<<(SPI_D_HSYNC_MODE_S))
#define SPI_D_HSYNC_MODE_V  0x7
#define SPI_D_HSYNC_MODE_S  9
/* SPI_D_DE_MODE : R/W ;bitpos:[8:6] ;default: 3'h0 ; */
/*description: the output spi_de is delayed by system clock cycles  0: output
 without delayed  1: output with the posedge of clk_apb 2 output with the negedge of clk_apb  3: output with the spi_clk. Can be configured in CONF state.*/
#define SPI_D_DE_MODE  0x00000007
#define SPI_D_DE_MODE_M  ((SPI_D_DE_MODE_V)<<(SPI_D_DE_MODE_S))
#define SPI_D_DE_MODE_V  0x7
#define SPI_D_DE_MODE_S  6
/* SPI_D_CD_MODE : R/W ;bitpos:[5:3] ;default: 3'h0 ; */
/*description: the output spi_cd is delayed by system clock cycles  0: output
 without delayed  1: output with the posedge of clk_apb 2 output with the negedge of clk_apb  3: output with the spi_clk. Can be configured in CONF state.*/
#define SPI_D_CD_MODE  0x00000007
#define SPI_D_CD_MODE_M  ((SPI_D_CD_MODE_V)<<(SPI_D_CD_MODE_S))
#define SPI_D_CD_MODE_V  0x7
#define SPI_D_CD_MODE_S  3
/* SPI_D_DQS_MODE : R/W ;bitpos:[2:0] ;default: 3'h0 ; */
/*description: the output spi_dqs is delayed by system clock cycles  0: output
 without delayed  1: output with the posedge of clk_apb 2 output with the negedge of clk_apb  3: output with the spi_clk. Can be configured in CONF state.*/
#define SPI_D_DQS_MODE  0x00000007
#define SPI_D_DQS_MODE_M  ((SPI_D_DQS_MODE_V)<<(SPI_D_DQS_MODE_S))
#define SPI_D_DQS_MODE_V  0x7
#define SPI_D_DQS_MODE_S  0

#define SPI_LCD_D_NUM_REG(i)          (REG_SPI_BASE(i) + 0x10C)
/* SPI_D_VSYNC_NUM : R/W ;bitpos:[9:8] ;default: 2'h0 ; */
/*description: the output spi_vsync is delayed by system clock cycles  0: delayed
 by 1 cycle  1: delayed by 2 cycles ... Can be configured in CONF state.*/
#define SPI_D_VSYNC_NUM  0x00000003
#define SPI_D_VSYNC_NUM_M  ((SPI_D_VSYNC_NUM_V)<<(SPI_D_VSYNC_NUM_S))
#define SPI_D_VSYNC_NUM_V  0x3
#define SPI_D_VSYNC_NUM_S  8
/* SPI_D_HSYNC_NUM : R/W ;bitpos:[7:6] ;default: 2'h0 ; */
/*description: the output spi_hsync is delayed by system clock cycles  0: delayed
 by 1 cycle  1: delayed by 2 cycles ... Can be configured in CONF state.*/
#define SPI_D_HSYNC_NUM  0x00000003
#define SPI_D_HSYNC_NUM_M  ((SPI_D_HSYNC_NUM_V)<<(SPI_D_HSYNC_NUM_S))
#define SPI_D_HSYNC_NUM_V  0x3
#define SPI_D_HSYNC_NUM_S  6
/* SPI_D_DE_NUM : R/W ;bitpos:[5:4] ;default: 2'h0 ; */
/*description: the output spi_de is delayed by system clock cycles  0: delayed
 by 1 cycle  1: delayed by 2 cycles ... Can be configured in CONF state.*/
#define SPI_D_DE_NUM  0x00000003
#define SPI_D_DE_NUM_M  ((SPI_D_DE_NUM_V)<<(SPI_D_DE_NUM_S))
#define SPI_D_DE_NUM_V  0x3
#define SPI_D_DE_NUM_S  4
/* SPI_D_CD_NUM : R/W ;bitpos:[3:2] ;default: 2'h0 ; */
/*description: the output spi_cd is delayed by system clock cycles  0: delayed
 by 1 cycle  1: delayed by 2 cycles ... Can be configured in CONF state.*/
#define SPI_D_CD_NUM  0x00000003
#define SPI_D_CD_NUM_M  ((SPI_D_CD_NUM_V)<<(SPI_D_CD_NUM_S))
#define SPI_D_CD_NUM_V  0x3
#define SPI_D_CD_NUM_S  2
/* SPI_D_DQS_NUM : R/W ;bitpos:[1:0] ;default: 2'h0 ; */
/*description: the output spi_dqs is delayed by system clock cycles  0: delayed
 by 1 cycle  1: delayed by 2 cycles ... Can be configured in CONF state.*/
#define SPI_D_DQS_NUM  0x00000003
#define SPI_D_DQS_NUM_M  ((SPI_D_DQS_NUM_V)<<(SPI_D_DQS_NUM_S))
#define SPI_D_DQS_NUM_V  0x3
#define SPI_D_DQS_NUM_S  0

#define SPI_DATE_REG(i)          (REG_SPI_BASE(i) + 0x3FC)
/* SPI_DATE : RW ;bitpos:[27:0] ;default: 28'h1902200 ; */
/*description: SPI register version.*/
#define SPI_DATE  0x0FFFFFFF
#define SPI_DATE_M  ((SPI_DATE_V)<<(SPI_DATE_S))
#define SPI_DATE_V  0xFFFFFFF
#define SPI_DATE_S  0

#ifdef __cplusplus
}
#endif



#endif /*_SOC_SPI_REG_H_ */


